# Web Scraping

In [22]:
import pandas as pd
import logging

logging.basicConfig(level=logging.INFO)

In [23]:
url = "https://id.wikipedia.org/wiki/Daftar_miliarder_Forbes"

In [24]:
def scrape(url):
  logging.info(f"Scraping website url: '{url}'....")
  return pd.read_html(url, header=None)

In [25]:
df = scrape(url)[4]

In [26]:
df

,No.,Nama,Kekayaan bersih (USD),Usia,Kebangsaan,Sumber kekayaan
0,NaN,Jeff Bezos,$112.0 miliar,54,Amerika Serikat,Amazon.com
1,NaN,Bill Gates,$90.0 miliar,62,Amerika Serikat,Microsoft
2,NaN,Warren Buffett,$84.0 miliar,87,Amerika Serikat,Berkshire Hathaway
3,NaN,Bernard Arnault,$72.0 miliar,69,Prancis,LVMH
4,NaN,Mark Zuckerberg,$71.0 miliar,33,Amerika Serikat,Facebook
5,NaN,Amancio Ortega,$70.0 miliar,81,Spanyol,"Inditex, Zara"
6,NaN,Carlos Slim,$67.1 miliar,78,Meksiko,"América Móvil, Grupo Carso"
7,NaN,Charles Koch,$60.0 miliar,82,Amerika Serikat,Koch Industries
8,NaN,David Koch,$60.0 miliar,77,Amerika Serikat,Koch Industries
9,NaN,Larry Ellison,$58.5 miliar,73,Amerika Serikat,Oracle Corporation

# Cleaning Data

In [71]:
import re

In [76]:
def is_money_miliar(string_money):
  return string_money.lower().endswith("miliar")

In [217]:
def transform_money_format(string_money):
  half_clean_string = string_money.lower().replace(",", ".").replace("$", "")
  return re.sub(r"[?\$\[M\]miliar]", "", half_clean_string)

In [227]:
def transform(df, tahun):
    logging.info("Transforming DataFrame ...")

    columns_mapping = {
        "No.": "nomor_urut",
        "Nama": "nama",
        "Kekayaan bersih (USD)": "kekayaan_bersih_usd",
        "Usia": "usia",
        "Kebangsaan": "kebangsaan",
        "Sumber kekayaan": "sumber_kekayaan"
    }

    renamed_df = df.rename(columns=columns_mapping)
    renamed_df["tahun"] = tahun
    renamed_df["perusahaan"] = renamed_df["sumber_kekayaan"]
    renamed_df["nomor_urut"] = renamed_df.index+1
    renamed_df["kekayaan_bersih_usd_juta"] = renamed_df["kekayaan_bersih_usd"].apply(
        lambda value: float(transform_money_format(value)) * 1000
    )

    return renamed_df[["nomor_urut", "nama", "kekayaan_bersih_usd_juta", "perusahaan", "usia", "kebangsaan", "sumber_kekayaan", "tahun"]]

In [228]:
df_2018 = transform(df, 2018)

In [229]:
df_2018

,nomor_urut,nama,kekayaan_bersih_usd_juta,perusahaan,usia,kebangsaan,sumber_kekayaan,tahun
0,1,Jeff Bezos,112000.0,Amazon.com,54,Amerika Serikat,Amazon.com,2018
1,2,Bill Gates,90000.0,Microsoft,62,Amerika Serikat,Microsoft,2018
2,3,Warren Buffett,84000.0,Berkshire Hathaway,87,Amerika Serikat,Berkshire Hathaway,2018
3,4,Bernard Arnault,72000.0,LVMH,69,Prancis,LVMH,2018
4,5,Mark Zuckerberg,71000.0,Facebook,33,Amerika Serikat,Facebook,2018
5,6,Amancio Ortega,70000.0,"Inditex, Zara",81,Spanyol,"Inditex, Zara",2018
6,7,Carlos Slim,67100.0,"América Móvil, Grupo Carso",78,Meksiko,"América Móvil, Grupo Carso",2018
7,8,Charles Koch,60000.0,Koch Industries,82,Amerika Serikat,Koch Industries,2018
8,9,David Koch,60000.0,Koch Industries,77,Amerika Serikat,Koch Industries,2018
9,10,Larry Ellison,58500.0,Oracle Corporation,73,Amerika Serikat,Oracle Corporation,2018

# Storing Data to Database

In [230]:
pip install psycopg2-binary==2.8.6

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: psycopg2-binary==2.8.6 in /usr/local/lib/python3.7/dist-packages (2.8.6)

In [231]:
from sqlalchemy import create_engine

In [232]:
DB_NAME = "postgres"
DB_USER = "user1"
DB_PASSWORD = "user1"
DB_HOST = "34.171.63.89"
DB_PORT = "5432"
CONNECTION_STRING = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
TABLE_NAME = "Ricko_orang_terkaya_forbes"

In [233]:
CONNECTION_STRING

'postgresql://user1:user1@34.171.63.89:5432/postgres'

In [234]:
def write_to_postgres(df, db_name, table_name, connection_string):
    engine = create_engine(connection_string)

    logging.info(f"Writing dataframe to database: '{db_name}', table: '{table_name}' ...")
    df.to_sql(name = table_name, con=engine, if_exists="replace", index=False)

In [235]:
write_to_postgres(df=df_2018, db_name=DB_NAME, table_name=TABLE_NAME, connection_string=CONNECTION_STRING)

# Read Data From Database

In [236]:
def read_from_postgres(db_name, table_name, connection_string):
  engine = create_engine(connection_string)

  logging.info(f"Reading postgres database: '{db_name}', table: '{table_name} ...")
  return pd.read_sql_table(table_name, con=engine)

In [237]:
result_df = read_from_postgres(db_name=DB_NAME, table_name=TABLE_NAME, connection_string=CONNECTION_STRING)

In [238]:
result_df

,nomor_urut,nama,kekayaan_bersih_usd_juta,perusahaan,usia,kebangsaan,sumber_kekayaan,tahun
0,1,Jeff Bezos,112000.0,Amazon.com,54,Amerika Serikat,Amazon.com,2018
1,2,Bill Gates,90000.0,Microsoft,62,Amerika Serikat,Microsoft,2018
2,3,Warren Buffett,84000.0,Berkshire Hathaway,87,Amerika Serikat,Berkshire Hathaway,2018
3,4,Bernard Arnault,72000.0,LVMH,69,Prancis,LVMH,2018
4,5,Mark Zuckerberg,71000.0,Facebook,33,Amerika Serikat,Facebook,2018
5,6,Amancio Ortega,70000.0,"Inditex, Zara",81,Spanyol,"Inditex, Zara",2018
6,7,Carlos Slim,67100.0,"América Móvil, Grupo Carso",78,Meksiko,"América Móvil, Grupo Carso",2018
7,8,Charles Koch,60000.0,Koch Industries,82,Amerika Serikat,Koch Industries,2018
8,9,David Koch,60000.0,Koch Industries,77,Amerika Serikat,Koch Industries,2018
9,10,Larry Ellison,58500.0,Oracle Corporation,73,Amerika Serikat,Oracle Corporation,2018

In [239]:
print("Daftar orang terkata di Forbes: ")
print(result_df.to_string())

Daftar orang terkata di Forbes:
   nomor_urut             nama  kekayaan_bersih_usd_juta                  perusahaan  usia       kebangsaan             sumber_kekayaan  tahun
0           1       Jeff Bezos                  112000.0                  Amazon.com    54  Amerika Serikat                  Amazon.com   2018
1           2       Bill Gates                   90000.0                   Microsoft    62  Amerika Serikat                   Microsoft   2018
2           3   Warren Buffett                   84000.0          Berkshire Hathaway    87  Amerika Serikat          Berkshire Hathaway   2018
3           4  Bernard Arnault                   72000.0                        LVMH    69          Prancis                        LVMH   2018
4           5  Mark Zuckerberg                   71000.0                    Facebook    33  Amerika Serikat                    Facebook   2018
5           6   Amancio Ortega                   70000.0               Inditex, Zara    81          Spanyol               Inditex, Zara   2018
6           7      Carlos Slim                   67100.0  América Móvil, Grupo Carso    78          Meksiko  América Móvil, Grupo Carso   2018
7           8     Charles Koch                   60000.0             Koch Industries    82  Amerika Serikat             Koch Industries   2018
8           9       David Koch                   60000.0             Koch Industries    77  Amerika Serikat             Koch Industries   2018
9          10    Larry Ellison                   58500.0          Oracle Corporation    73  Amerika Serikat          Oracle Corporation   2018